# Studio: Working with Databases in Python

For today's studio, we will be using the [TV Shows dataset](https://www.kaggle.com/ruchi798/tv-shows-on-netflix-prime-video-hulu-and-disney) from Kaggle. We have already downloaded the CSV for you.

You will also be using the watchlist you just created to figure out which streaming services contain the shows that you want to watch next so you can decide which one is worth the money to you.

As you complete the different tasks in the studio, you may choose between using Pandas or SQL. Remember that during the prep work, we learned that one is oftentimes more efficient at certain tasks than the other, so choose wisely!

## My Watchlist

If you would like, please use this space to make note of your watchlist by editing the text cell.

## Database Setup

To start with, import the necessary libraries and create a dataframe from the provided CSV. Print the info out for the dataframe. After that, you may drop the column called `Unnamed: 0` and rename any columns with spaces in the names or unusual characters such as `"+"`. Print out the info for the dataframe again to ensure that your changes were effective.

In [106]:
import pandas as pd
import sqlite3 as sql

tv_df = pd.read_csv("tv_shows.csv")

In [107]:
tv_df = tv_df.drop(columns = ['Unnamed: 0'])

In [108]:
tv_df = tv_df.rename(columns={"Rotten Tomatoes":"Rotten_Tomatoes", "Prime Video":"Prime_Video", "Disney+":"Disney"})

In [109]:
tv_df.head()

,ID,Title,Year,Age,IMDb,Rotten_Tomatoes,Netflix,Hulu,Prime_Video,Disney,Type
0,1,Breaking Bad,2008,18+,9.4/10,100/100,1,0,0,0,1
1,2,Stranger Things,2016,16+,8.7/10,96/100,1,0,0,0,1
2,3,Attack on Titan,2013,18+,9.0/10,95/100,1,1,0,0,1
3,4,Better Call Saul,2015,18+,8.8/10,94/100,1,0,0,0,1
4,5,Dark,2017,16+,8.8/10,93/100,1,0,0,0,1

With your dataframe at the ready, create a new database called `tv`. Add a new table to your database called `shows` using the data in the dataframe.

In [110]:
con = sql.connect('tv.db')
#tv_df.to_sql('shows', con)
#messed up and created a table before running above cells somehow, creating new table calles shows2

In [111]:
tv_df.to_sql('shows2', con)

ValueError: Table 'shows2' already exists.

With your new table and database set up, print out the top 20 records in the `shows`Â table.

In [ ]:
pd.read_sql_query('SELECT * FROM shows2 LIMIT 20', con)

Now add a table that includes an id number and the titles on your watchlist.

In [ ]:
with con:
    con.execute("""
        CREATE TABLE watchlist2 (
            ID INT,
            Title TEXT
        );
    """)

In [ ]:
sql = 'INSERT INTO watchlist2 (ID, Title) values(?,?)'
data = [(1, 'Evil'),
   (2, 'Tuca & Bertie'),
  (3, 'Gilmore Girls'),
  (4, 'The Great Pottery Throw Down'),
 (5, 'The Wilds'),
 (6, 'The Marvelous Mrs. Maisel'),
 (7, 'The Umbrella Academy'),
 (8, 'Ozark'),
 (9, 'Killing Eve'),
 (10, "SCHITT'S CREEK")]

In [ ]:
with con:
    con.executemany(sql, data)

## Working with the Data

Using either Pandas or SQL, determine how many shows are on each streaming service and what the mean is for each streaming service. 

**Note**: You may notice that the mean represents the percentage of shows in the dataframe that are on each streaming service. Take a moment to think about why that is.

In [112]:
cols=['Netflix', 'Hulu', 'Prime_Video', 'Disney']
tv_df[cols].sum()

Netflix        1971
Hulu           1621
Prime_Video    1831
Disney          351
dtype: int64

Join your watchlist data with the shows data to determine which streaming services your watchlist shows are on and make a new table in your database using the joined data. Print out the data in your joined table to see what shows on your watchlist on in the original dataset. With the joined data, determine the percentage of your watchlist shows that are on each streaming service and how many of your watchlist shows are on each streaming service.

In [113]:
sql = 'SELECT * FROM shows2 INNER JOIN watchlist2 ON shows2.Title = watchlist2.Title'
with con:
    con.execute(sql)

In [115]:
pd.read_sql_query('SELECT Title, Netflix, Hulu, Prime_Video, Disney FROM shows2 INNER JOIN watchlist2 ON shows2.Title = watchlist2.Title', con)

DatabaseError: Execution failed on sql 'SELECT Title, Netflix, Hulu, Prime_Video, Disney FROM shows2 INNER JOIN watchlist2 ON shows2.Title = watchlist2.Title': ambiguous column name: Title

In [114]:
#joined_watchlist = pd.read_sql_query('SELECT Title, Netflix, Hulu, Prime_Video, Disney FROM shows2 INNER JOIN watchlist2 ON shows2.Title = watchlist2.Title', con)
#joined_watchlist.to_sql('joined_watchlist3', con)

DatabaseError: Execution failed on sql 'SELECT Title, Netflix, Hulu, Prime_Video, Disney FROM shows2 INNER JOIN watchlist2 ON shows2.Title = watchlist2.Title': ambiguous column name: Title

OperationalError: no such table: tv_df.joined_watchlist

## Results

Now that you have done your analysis, make note of the answers to the following questions by editing the text cell:

1. Was every show on your watchlist in the Kaggle dataset? Do you have any ideas as to why a show might not have been present?  </br>
No, two were missing. Both contained special characters, so I think they may not have matched the exact format of the title in the database since I joined on title.
2. Did you include a show or shows in your watchlist that is exclusive to one of the platforms? How might that have impacted your analysis?
Yes; there may be some that are on platforms that aren't even listed in the database
2. Which streaming service(s) offered the most shows on your watchlist? Which streaming service(s) offered the least?
3. Based on the shows you want to watch and the results of your analysis, is there a streaming service you think would be a good fit for you?